app/controllers/translate_controller.rb

SELECT  1 AS one FROM "words" WHERE "words"."spindi" = $1 LIMIT 1  [["spindi", "100"]]
---
  def spindi2bg
    @input = params[:spinditext]

    if @input
      @text = @input.dup
      @words = @text.gsub(/[^а-яА-Я0-9\-]/," ").split(" ").uniq
      @replace = []

      @words.each do |word|
        if Word.exists?(spindi: UnicodeUtils.downcase(word))