app/controllers/translate_controller.rb

SELECT  "words".* FROM "words" WHERE "words"."spindi" = $1 LIMIT 1  [["spindi", "макло"]]
---
  def spindi2bg
    @input = params[:spinditext]

    if @input
      @text = @input.dup
      @words = @text.gsub(/[^а-яА-Я0-9\-]/," ").split(" ").uniq

      @words.each do |word|
        @record = Word.find_by(spindi: UnicodeUtils.downcase(word))

SELECT  "words".* FROM "words" WHERE "words"."bg" = $1 LIMIT 1  [["bg", "спиндии"]]
---
  def bg2spindi
    @input = params[:bgtext]

    if @input
      @text = @input.dup
      @words = @text.gsub(/[^а-яА-Я0-9\-]/," ").split(" ").uniq

      @words.each do |word|
        @record = Word.find_by(bg: UnicodeUtils.downcase(word))