app/controllers/translate_controller.rb

  def main
    @text = params[:spinditext]

    if @text
      @words = @text.gsub(/[^а-яА-Я0-9\-]/," ").split(" ").uniq
      @replace = []

      @words.each do |word|
        if Word.exists?(spindi: UnicodeUtils.downcase(word))
---
SELECT  "words".* FROM "words" WHERE "words"."spindi" = $1 LIMIT 1  [["spindi", "фостата"]]
SELECT  1 AS one FROM "words" WHERE "words"."spindi" = $1 LIMIT 1  [["spindi", "Bat"]]